Repository: willtrimz/SFIA-Generator
Catalog: locale/*/LC_MESSAGES/django.po
Languages: cy

source: SFIA Generator
cy: Generadur SFIA

source: Form Generator
cy: Generadur Ffurflen

source: Skill Search
cy: Chwiliwr Sgiliau

source: Browse/Select Skills
cy: Pori/Dewis sgiliau

source: Staff Login
cy: Mewngofnodi Staff

source: Skill 1:
cy: Sgil 1

source: Skill 1 Code (ex: PROD):
cy: Côd Sgil 1 (e.e. PROD)

source: Skill 1 Range
cy: Ystod sgil 1

source: Skill 2:
cy: Sgil 2

source: Skill 2 Code (ex: TEST) (Optional):
cy: Côd Sgil 2 (e.e. TEST) (Dewisol)

source: (Optional)
cy: (Dewisol)

source: Skill 2 Range
cy: Ystod sgil 2

source: Render skills on dedicated pages
cy: Rhowch sgiliau ar dudalennau penodol

source: Form Type:
cy: Math o ffurflen

source: Student
cy: Myfyriwr

source: Employer
cy: Cyflogwr

source: Click Here to Download Document
cy: Cliciwch yma i lawrlwytho dogfen

source: Request invalid
cy: Cais yn annilys

source: Please check skill codes in the SFIA document.
cy: Gwiriwch godau sgiliau yn y ddogfen SFIA.

source: This window will close soon.
cy: Bydd y ffenestr hon yn cau yn fuan

source: Unfortunately the SFIA skills are not currently available in Welsh
cy: Yn anffodus, nid yw sgiliau SFIA ar gael yn Gymraeg ar hyn o bryd

source: Click here to select a different first skill
cy: Cliciwch yma i ddewis sgil gyntaf wahanol

source: Skill Search:
cy: Chwiliwr Sgiliau

source: Type/paste a paragraph about the skills you have/want to refine or paste in your resume:
cy: Teipiwch/pastiwch baragraff am y sgiliau sydd gennych/eisiau eu mireinio neu eu pastio yn eich CV:

source: Unfortunately the search tool only works with English text.
cy: Yn anffodus, mae’r teclyn chwilio yn gweithio gyda thestun Saesneg yn unig

source: Please fill in this form field.
cy: Llenwch y maes hwn ar y ffurflen.

source: Click here to search for suitable skill
cy: Cliciwch yma i chwilio am sgiliau addas.

source: Click Here to Pre-Populate Form
cy: Cliciwch yma i lenwi’r ffurflen ymlaen llaw.

source: Click here to select a different second skill
cy: Cliciwch yma i ddewis ail sgil wahanol

source: Click Here to Pre-Populate Form with only one skill
cy: Cliciwch yma i lenwi’r ffurflen ymlaen llaw gydag un sgil yn unig

source: Click here to select this as your first skill
cy: Cliciwch yma i ddewis hwn fel eich sgil gyntaf

source: Click here to restart selection or list skills
cy: Cliciwch yma i ailgychwyn dewis neu restru sgiliau

source: Click here to show the list of skills or select skills
cy: Cliciwch yma i ddangos y rhestr o sgiliau neu ddewis sgiliau

source: Skills Information:
cy: Gwybodaeth sgiliau:

source: Invalid skill range:
cy: Ystod sgiliau annilys:

source: . This skill only has the following levels:
cy: . Dim ond y lefelau canlynol sydd gan y sgil hwn:

source: Request invalid. Please check the SFIA skill codes to ensure the codes you entered are valid
cy: Cais annilys. Gwiriwch godau sgiliau SFIA i sicrhau bod y codau rydych wedi'u cofnodi yn ddilys.

source: The form has been pre-populated with the search results. If no suitable skills have been found, the fields have been left blank.
cy: Mae'r ffurflen wedi'i llenwi ymlaen llaw gyda'r canlyniadau chwilio. Os na ddaethpwyd o hyd i unrhyw sgiliau addas, mae’r meysydd wedi’u gadael yn wag.

source: has been selected as the first skill. Please select the second.
cy: wedi'i ddewis fel y sgil gyntaf. Dewiswch yr ail.
